# Relatório de Análise V

## Tratamento de Dados Faltantes

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep = ';')

In [3]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0,29.33,Casa
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0,15.38,Casa
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,50.00,Apartamento

In [4]:
dados.isnull()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
21821,False,False,False,False,False,False,False,False,False,False,False
21822,False,False,False,False,False,False,False,False,False,False,False
21823,False,False,False,False,False,False,False,False,False,False,False
21824,False,False,False,False,False,False,False,False,False,False,False
21825,False,False,False,False,False,False,False,False,False,False,False

In [5]:
dados.notnull()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...
21821,True,True,True,True,True,True,True,True,True,True,True
21822,True,True,True,True,True,True,True,True,True,True,True
21823,True,True,True,True,True,True,True,True,True,True,True
21824,True,True,True,True,True,True,True,True,True,True,True
21825,True,True,True,True,True,True,True,True,True,True,True

In [6]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21826 entries, 0 to 21825
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tipo           21826 non-null  object
 1   Bairro         21826 non-null  object
 2   Quartos        21826 non-null  int64
 3   Vagas          21826 non-null  int64
 4   Suites         21826 non-null  int64
 5   Area           21826 non-null  int64
 6   Valor          21826 non-null  float64
 7   Condominio     21826 non-null  float64
 8   IPTU           21826 non-null  float64
 9   Valor m2       21826 non-null  float64
 10  Tipo Agregado  21826 non-null  object
dtypes: float64(4), int64(4), object(3)
memory usage: 1.8+ MB

In [7]:
dados['Valor'].isnull()

0        False
1        False
2        False
3        False
4        False
         ...
21821    False
21822    False
21823    False
21824    False
21825    False
Name: Valor, Length: 21826, dtype: bool

In [8]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU, Valor m2, Tipo Agregado]
Index: []

In [9]:
A = dados.shape[0]
dados.dropna(subset = ['Valor'], inplace = True)
B = dados.shape[0]
A - B

0

In [10]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU, Valor m2, Tipo Agregado]
Index: []

## Tratamento de Dados Faltantes (continuação)

In [11]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [12]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [ ]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

In [ ]:
dados = dados.fillna({'Condominio': 0, 'IPTU': 0})

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

In [ ]:
dados[dados['IPTU'].isnull()].shape[0]

In [ ]:
dados.info()

In [ ]:
dados.to_csv('dados/aluguel_residencial.csv', sep = ';', index = False)